export const WIDTH = window.innerWidth;
export const BASE_URL = 'https://newsapi.org';




export const BLOGS = [
  {
    id: 1,
    img_url: "https://www.colliers.com/-/media/images/colliers/asia/philippines/colliers-review/collierreview_hero_image_01312022.ashx?bid=d66124ce6b944fad86f787828cc8337b&h=1040&w=1536&hash=97CE6501D10D5930CAE420E1ADC154BB",
    title: "ماهو مستقبل التجارة الالكترونية", description: "من المتوقع أن تزيد المبيعات من 1.3 تريليون عام 2014  الى 4.5 تريليون فى عام 2021",
    subtitle: 'افكار البزنس',
    author: "امل سليم"
  },
  {
    id: 2,
    img_url: "https://eatsleepworkrepeat.com/wp-content/uploads/2020/06/office.jpg",
    title: "ماهو مستقبل التجارة الالكترونية", description: "من المتوقع أن تزيد المبيعات من 1.3 تريليون عام 2014  الى 4.5 تريليون فى عام 2021",
    subtitle: 'افكار البزنس',
    author: "امل سليم"
  },
  {
    id: 3,
    img_url: "https://jssors8.azureedge.net/demos/image-slider/img/px-beach-daylight-fun-1430675-image.jpg",
    title: "ماهو مستقبل التجارة الالكترونية", description: "من المتوقع أن تزيد المبيعات من 1.3 تريليون عام 2014  الى 4.5 تريليون فى عام 2021",
    subtitle: 'افكار البزنس',
    author: "امل سليم"
  },

]
export const SLIDERS = [
  {
    img_url: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSkj52qKIfmnfeD1cKv4eSDsNibhefuwDpTjQ&usqp=CAU",
    title: "This is title One", description: "من المتوقع أن تزيد المبيعات من 1.3 تريليون عام 2014  الى 4.5 تريليون فى عام 2021",

    author: "امل سليم"
  },
  {
    img_url: "https://i.pinimg.com/originals/d0/d3/f1/d0d3f14a1967c4ea5b994c97245bea23.jpg",
    title: " اماكن التسويق", description: "من المتوقع أن تزيد المبيعات من 1.3 تريليون عام 2014  الى 4.5 تريليون فى عام 2021",
    author: "aamal saleem"
  },
  {
    img_url: "https://marketplace.canva.com/EAFFa0epvBY/1/0/1600w/canva-pink-pastel-feminine-motivational-twitter-header-heD_GVbuKHo.jpg",
    title: "this is title three", description: "this is description three ",
    author: "aamal saleem"
  }
]

export const REPORT = {
  id: 1,
  title: "whwpfrfrepovkepojvrepovj vckerpvekrpov",
  image_url: 'https://i.pinimg.com/736x/d4/c8/ae/d4c8aeb19a1b53aaee0667f0c746eb02--twitter-inc-header-image.jpg',
  created_at: '11/ 2/ 2033',
  auther: { id: 2, name: "Amal Saleem" },
  contents: [
    {
      id: 1,
      headline: '',
      description: " ..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدغلّبيُ",
      image_path: ''
    },
    {
      id: 2,
      headline: 'what is the usful of benijg',
      description: " ..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم ٪64 غلّبيُ",
      image_path: ''
    },
    {
      id: 3,
      headline: '؟تنرتنإلا ىلع هعيبتس يذلا ام',
      description: " ..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم..حيحصلا ناكملا يف تنأف تنرتنإلا ىلع تاجتنملا عيب ةيفيك ةفرعمو كلذ نم حبرلا قيقحت يف بغرت تنك اذإ ،رهش لك تنرتنإلا ربع ةمدخ وأ جتنم ءارش نع نآلا نييدوعسلا نم ٪64 غلّبيُ",
      image_path: 'https://image.shutterstock.com/image-vector/email-marketing-rules-regulations-icon-260nw-1431812621.jpg'
    }
  ]
}